# Создать список, состоящий из кубов нечётных чисел от 1 до 1000 (куб X - третья степень
# числа X):
# a. Вычислить сумму тех чисел из этого списка, сумма цифр которых делится нацело на 7.
# Например, число «19 ^ 3 = 6859» будем включать в сумму, так как 6 + 8 + 5 + 9 = 28 –
# делится нацело на 7. Внимание: использовать только арифметические операции!
# b. К каждому элементу списка добавить 17 и заново вычислить сумму тех чисел из этого
# списка, сумма цифр которых делится нацело на 7.
# c.
# * Решить задачу под пунктом b, не создавая новый список.
import copy
final_list = []
numbers = 0
take = 0
odd_numbers = list(range(1, 1000, 2))
for i in odd_numbers:
    odd = i ** 3 + 17
    final_list.append(odd)
    print(odd)
    jhi = copy.deepcopy(odd)
    amount = 0
    while jhi > 0:
        take = jhi % 10
        amount = amount + take
        jhi = jhi // 10
    if amount % 7 == 0:
        numbers = numbers + odd
print(numbers)


